app/Controllers/ConAdminWorkPerson.php

SELECT `pers_id`, `pers_prefix`, `pers_firstname`, `pers_lastname`, `pers_img`, `posi_name`, `pers_academic`
FROM `tb_personnel`
JOIN `skjacth_skj`.`tb_position` ON `skjacth_skj`.`tb_position`.`posi_id` = `skjacth_personnel`.`tb_personnel`.`pers_position`
WHERE `pers_status` = 'กำลังใช้งาน'
AND `pers_learning` = 'lear_001'
ORDER BY `pers_numberGroup` ASC
---
    public function PersonneViewGroup($Key){
        $session = session();
        $data = $this->DataMain();
        $data['title']="ข้อมูลตามกลุ่ม";

        $DB_Personnel = \Config\Database::connect('personnel');
        $DBPers = $DB_Personnel->table('tb_personnel');
        $sub = explode("_",$Key);
        if($sub[0] == "posi"){
            $Where = ['pers_position'=>$Key];
            $data['Teach'] = false;
        }elseif($Key === "Executive"){
            $Where = 'pers_position = "posi_001" || pers_position= "posi_002"';
            $data['Teach'] = true;
        }
        else{
            $Where = ['pers_learning'=>$Key];
            $data['Teach'] = true;
        }

        $data["Teacher"] = $DBPers
        ->select('pers_id,pers_prefix,pers_firstname,pers_lastname,pers_img,posi_name,pers_academic')
        ->join('skjacth_skj.tb_position','skjacth_skj.tb_position.posi_id = skjacth_personnel.tb_personnel.pers_position')
        ->where('pers_status',"กำลังใช้งาน")
        ->where($Where)
        ->orderBy('pers_numberGroup','ASC')
        ->get()->getResult();