app/Controllers/ConAdminNotification.php

SELECT MAX(booking_id) as booking_id, `booking_order`, MAX(booking_title) as booking_title, MAX(booking_dateStart) as booking_dateStart, MAX(booking_timeStart) as booking_timeStart
FROM `tb_booking`
WHERE `booking_admin_approve` NOT IN ('อนุมัติ','ไม่อนุมัติ','ยกเลิก')
GROUP BY `booking_order`
ORDER BY `booking_id` DESC
 LIMIT 5
---

            // 2. Room Bookings
            if (($isSuperAdmin || strpos($userRoles, 'งานอาคารสถานที่') !== false) && (!$targetSystem || $targetSystem === 'room')) {
                $roomBookings = $database->table('tb_booking')
                    ->select('MAX(booking_id) as booking_id, booking_order, MAX(booking_title) as booking_title, MAX(booking_dateStart) as booking_dateStart, MAX(booking_timeStart) as booking_timeStart')
                    ->whereNotIn('booking_admin_approve', ['อนุมัติ', 'ไม่อนุมัติ', 'ยกเลิก'])
                    ->groupBy('booking_order')
                    ->orderBy('booking_id', 'DESC')
                    ->limit(5)
                    ->get()->getResult();

SELECT COUNT(DISTINCT booking_order) as total
FROM `tb_booking`
WHERE `booking_admin_approve` NOT IN ('อนุมัติ','ไม่อนุมัติ','ยกเลิก')
---
                        'color' => 'bg-info'
                    ];
                }
                $roomCount = $database->table('tb_booking')
                    ->whereNotIn('booking_admin_approve', ['อนุมัติ', 'ไม่อนุมัติ', 'ยกเลิก'])
                    ->distinct()
                    ->countAllResults('booking_order');

SELECT MAX(repair_ID) as repair_ID, `repair_order`, MAX(repair_caselist) as repair_caselist, MAX(repair_datetime) as repair_datetime
FROM `tb_repair`
WHERE `repair_status` = 'รอดำเนินการ'
GROUP BY `repair_order`
ORDER BY `repair_ID` DESC
 LIMIT 5
---

            // 3. Repair Requests
            if (($isSuperAdmin || strpos($userRoles, 'งานแจ้งซ่อม') !== false) && (!$targetSystem || $targetSystem === 'repair')) {
                $repairs = $database->table('tb_repair')
                    ->select('MAX(repair_ID) as repair_ID, repair_order, MAX(repair_caselist) as repair_caselist, MAX(repair_datetime) as repair_datetime')
                    ->where('repair_status', 'รอดำเนินการ')
                    ->groupBy('repair_order')
                    ->orderBy('repair_ID', 'DESC')
                    ->limit(5)
                    ->get()->getResult();

SELECT COUNT(DISTINCT repair_order) as total
FROM `tb_repair`
WHERE `repair_status` = 'รอดำเนินการ'
---
                        'color' => 'bg-danger'
                    ];
                }
                $repairCount = $database->table('tb_repair')
                    ->where('repair_status', 'รอดำเนินการ')
                    ->distinct()
                    ->countAllResults('repair_order');