app/Controllers/ConUserHome.php

    public function index()
    {
        $session = session();
        $database = \Config\Database::connect();
        $builder = $database->table('tb_location');

        $data = $this->DataMain();
        $data['title']="หน้าแรก";
        $data['description']="หน้าแรกระบบงาน E-Office";
        $data['UrlMenuMain'] = '';
        $data['UrlMenuSub'] = '';

        $data['DictationAll'] = $builder->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tb_location`