app/Controllers/ConUserCarBooking.php

SELECT *
FROM `tb_school_car`
---
    public function CarBookingCheckCar()
    {
        $data = $this->DataMain();
        $data['title']="เช็ครถก่อนทำการจอง";
        $data['description']="เช็ครถก่อนทำการจอง";
        $data['UrlMenuMain'] = 'CarBooking';
        $data['UrlMenuSub'] = 'CarBookingCheck';
        $session = session();


        $database = \Config\Database::connect();
        $builder = $database->table('tb_school_car');
        $data['CheckCar'] = $builder->get()->getResult();

SELECT *
FROM `tb_car_reservation`
WHERE `car_reserv_id` = '163'
---
    public function CarBookingEdit($id = null)
    {
        $session = session();
        if(!$session->get('username')){
            return redirect()->to(base_url('LoginOfficerGeneral?return_to='.urlencode(current_url())));
        }

        $database = \Config\Database::connect();
        $DBCarReservation = $database->table('tb_car_reservation');
        $booking = $DBCarReservation->where('car_reserv_id', $id)->get()->getRow();

SELECT *
FROM `tb_school_car`
---
        $data['Datethai'] = new Datethai();

        $DBSchoolCar = $database->table('tb_school_car');
        $data['CarList'] = $DBSchoolCar->get()->getResult(); // List of cars for dropdown if needed

SELECT *
FROM `tb_personnel`
WHERE `pers_status` = 'กำลังใช้งาน'
ORDER BY `pers_position` ASC
---
        // Fetch Personnel for Dropdown (SelPres)
        $DBpers = \Config\Database::connect('personnel');
        $DBpersonnel = $DBpers->table('tb_personnel');
        $data['SelPres'] = $DBpersonnel->where('pers_status','กำลังใช้งาน')
        ->orderBy('pers_position','ASC')
        ->get()->getResult();