app/Controllers/ConUserRepair.php

    public function RepairStatisticsCaselist(){
        $session = session();
        $database = \Config\Database::connect();
        $DBRepair = $database->table('tb_repair');

        $data['Bar'] = $DBRepair
        ->select('repair_caselist, COUNT(*) as total')
        ->groupBy('repair_caselist')
        ->get()
        ->getResult();

        $data['Pie'] = $DBRepair
        ->select('repair_status, COUNT(*) as total')
        ->groupBy('repair_status')
        ->get()
        ->getResult();
---
SELECT `repair_caselist`, COUNT(*) as total
FROM `tb_repair`
GROUP BY `repair_caselist`
SELECT `repair_status`, COUNT(*) as total
FROM `tb_repair`
GROUP BY `repair_status`