app/Controllers/ConUserBooking.php

    public function BookingMain()
    {
        $session = session();
        $data = $this->DataMain();
        $data['title']="จองห้อง / สถานที่";
        $data['description']="ระบบสำหรับจองห้อง / สถานที่ ภายในโรงเรียน";
        $data['UrlMenuMain'] = 'Booking';
        $data['UrlMenuSub'] = 'BookingMain';

        $database = \Config\Database::connect();
        $builder = $database->table('tb_location');
        $data['LocationList'] = $builder->get()->getResult();
        $data['CountLocationRoomAll'] = count($data['LocationList']);

        $DBbooking = $database->table('tb_booking');
        $data['CountbookingAll'] = $DBbooking->countAll();
        $data['NumRowsWaitApprove'] = $DBbooking->where('booking_admin_approve','ไม่อนุมัติ')->get()->getNumRows();
---
SELECT COUNT(*) AS `numrows` FROM `tb_booking`
SELECT *
FROM `tb_booking`
WHERE `booking_admin_approve` = 'อนุมัติ'

    public function BookingAdd($LocationID = null)
    {
        $session = session();
        if(!$session->get('username')){
            return redirect()->to(base_url());
        }

        // Check if LocationID is provided
        if (is_null($LocationID)) {
            return redirect()->to(base_url('Booking'))->with('error', 'กรุณาเลือกห้องสถานที่ก่อนทำการจอง');
---
SELECT *
FROM `tb_booking`
ORDER BY `booking_id` DESC

    public function getBookingCalendarJson()
    {
        $request = service('request');
        $month = $request->getGet('month');
        $year = $request->getGet('year');

        if (!$month || !$year) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Missing month or year']);
        }


        // So the value is Gregorian.

        $startDate = "$year-$month-01";
        $endDate = date("Y-m-t", strtotime($startDate));

        $database = \Config\Database::connect();
        $DBbooking = $database->table('tb_booking');

        $bookings = $DBbooking
            ->select('booking_id, booking_title, booking_Booker, booking_dateStart, booking_dateEnd, booking_timeStart, booking_timeEnd, booking_locationroom, booking_admin_approve, booking_typeuse, booking_telephone, booking_equipment, booking_other, pers_prefix, pers_firstname, pers_lastname')
            ->join('skjacth_personnel.tb_personnel', 'tb_booking.booking_Booker = skjacth_personnel.tb_personnel.pers_id', 'left')
            ->where("booking_dateStart <=", $endDate)
            ->where("booking_dateEnd >=", $startDate)
            ->get()->getResult();
---
SELECT `booking_id`, `booking_title`, `booking_Booker`, `booking_dateStart`, `booking_dateEnd`, `booking_timeStart`, `booking_timeEnd`, `booking_locationroom`, `booking_admin_approve`, `booking_typeuse`, `booking_telephone`, `booking_equipment`, `booking_other`, `pers_prefix`, `pers_firstname`, `pers_lastname`
FROM `tb_booking`
LEFT JOIN `skjacth_personnel`.`tb_personnel` ON `tb_booking`.`booking_Booker` = `skjacth_personnel`.`tb_personnel`.`pers_id`
WHERE `booking_dateStart` <= '2026-01-31'
AND `booking_dateEnd` >= '2026-1-01'