app/Controllers/ConUserBooking.php

SELECT *
FROM `tb_booking`
WHERE `booking_locationroom` = '6'
AND STR_TO_DATE(CONCAT(booking_dateStart, ' ', booking_timeStart), '%Y-%m-%d %H:%i:%s') < '2025-07-25 16:00:00'
AND STR_TO_DATE(CONCAT(booking_dateEnd, ' ', booking_timeEnd), '%Y-%m-%d %H:%i:%s') > '2025-07-25 12:00:00'
AND `booking_admin_approve` != 'ไม่อนุมัติ'
---
    public function CheckDateBooking(){
        // print_r($this->request->getVar());
        $session = session();
        $database = \Config\Database::connect();
        $DBbooking = $database->table('tb_booking');
        $locationroom       = $this->request->getPost('booking_locationroom');
        $dateStart          = $this->request->getPost('booking_dateStart');
        $timeStart          = $this->request->getPost('booking_timeStart');
        $dateEnd            = $this->request->getPost('booking_dateEnd');
        $timeEnd            = $this->request->getPost('booking_timeEnd');

         // ถ้ายังไม่กรอกครบ ให้ส่งข้อความว่า "รอตรวจสอบ"
        if (!$dateStart || !$timeStart || !$dateEnd || !$timeEnd) {
            return $this->response->setJSON([
                'status' => null,
                'message' => '🕐 เลือกวันและเวลาให้ครบก่อนระบบจะตรวจสอบการจอง',
                'class' => 'alert alert-warning'
            ]);
        }

        $gDateStart = $this->convertBuddhistToGregorian($dateStart);
        $gDateEnd   = $this->convertBuddhistToGregorian($dateEnd);

        $proposedStart = date('Y-m-d H:i:s',strtotime($gDateStart . ' ' . $timeStart));
        $proposedEnd   = date('Y-m-d H:i:s',strtotime($gDateEnd   . ' ' . $timeEnd));

        $CheckDateBookign = $DBbooking
        ->where('booking_locationroom', $locationroom)
        ->where("STR_TO_DATE(CONCAT(booking_dateStart, ' ', booking_timeStart), '%Y-%m-%d %H:%i:%s') < '$proposedEnd'", null, false)
        ->where("STR_TO_DATE(CONCAT(booking_dateEnd, ' ', booking_timeEnd), '%Y-%m-%d %H:%i:%s') > '$proposedStart'", null, false)
        ->where('booking_admin_approve !=', 'ไม่อนุมัติ')
        ->get()->getResult();