app/Controllers/ConUserRepair.php

SELECT COUNT(*) AS `numrows` FROM `tb_location`
---
    public function RepairMain()
    {
        $session = session();
        $database = \Config\Database::connect();
        $builder = $database->table('tb_location');

        $data = $this->DataMain();
        $data['title']="ระบบงานแจ้งซ่อม";
        $data['description']="หน้าแรกระบบงานแจ้งซ่อม";
        $data['UrlMenuMain'] = 'Repair';
        $data['UrlMenuSub'] = '';
        $data['Datethai'] = new Datethai();

        $data['DictationAll'] = $builder->countAll();

SELECT *
FROM `tb_position`
---
    public function RepairAdd()
    {
        $session = session();
        $database = \Config\Database::connect();
        $DBpers = \Config\Database::connect('personnel');
        $DBskj = \Config\Database::connect('skj');
        $Skj = $DBskj->table('tb_position');
        $builder = $database->table('tb_location');

        $data = $this->DataMain();
        $data['title']="เพิ่มข้อมูลงานแจ้งซ่อม";
        $data['description']="บันทึกงานแจ้งซ่อม";
        $data['UrlMenuMain'] = 'Repair';
        $data['UrlMenuSub'] = '';

       $data['Posi'] = $Skj->get()->getResult();

SELECT `repair_ID`, `repair_order`, `repair_datetime`, `repair_userID`, `repair_phone`, `repair_caselist`, `repair_status`, `pers_prefix`, `pers_firstname`, `pers_lastname`
FROM `tb_repair`
JOIN `skjacth_personnel`.`tb_personnel` ON `tb_repair`.`repair_userID` = `tb_personnel`.`pers_id`
---
    public function DataTableShowRepari(){
        $session = session();
        $DBrepair = \Config\Database::connect();
        $TBrepair = $DBrepair->table('tb_repair');
        $DBpers = \Config\Database::connect('personnel');
        $TBPres = $DBpers->table('tb_personnel');
        $Datethai = new Datethai();

       $S_data = $TBrepair->select('
       repair_ID,repair_order,repair_datetime,repair_userID,repair_phone,repair_caselist,repair_status,pers_prefix,pers_firstname,pers_lastname
       ')
       ->join('skjacth_personnel.tb_personnel','tb_repair.repair_userID = tb_personnel.pers_id')
       ->get()->getResult();

SELECT `tb_repair`.*, `tb_position`.`posi_name`, `tb_personnel`.`pers_prefix`, `tb_personnel`.`pers_firstname`, `tb_personnel`.`pers_lastname`
FROM `tb_repair`
JOIN `skjacth_personnel`.`tb_personnel` ON `tb_repair`.`repair_userID` = `tb_personnel`.`pers_id`
JOIN `skjacth_skj`.`tb_position` ON `tb_repair`.`repair_posi` = `tb_position`.`posi_id`
WHERE `repair_order` = 'SKJRP_20230084'
SELECT CONCAT(pers_prefix, `pers_firstname`, ' ', pers_lastname) AS Repairman
FROM `tb_personnel`
WHERE `pers_id` = ''
---
    public function ViewOrder($IDorder){
        $session = session();
        $data = $this->DataMain();
        $data['title'] = "รายละเอียดการแจ้งซ่อม";
        $data['description']="รายละเอียดการแจ้งซ่อม";
        $data['UrlMenuMain'] = 'Repair';
        $data['UrlMenuSub'] = 'ViewOrder';
        $data['Datethai'] = new Datethai();

        $DBrepair = \Config\Database::connect();
        $TBrepair = $DBrepair->table('tb_repair');
        $DBpers = \Config\Database::connect('personnel');
        $TBpers = $DBpers->table('tb_personnel');

        $data['RepaiUser'] = $TBrepair->select('tb_repair.*,tb_position.posi_name,tb_personnel.pers_prefix,tb_personnel.pers_firstname,tb_personnel.pers_lastname')
        ->where('repair_order',$IDorder)
        ->join('skjacth_personnel.tb_personnel','tb_repair.repair_userID = tb_personnel.pers_id')
        ->join('skjacth_skj.tb_position','tb_repair.repair_posi = tb_position.posi_id')
        ->get()->getResult();

        $data['Repairman'] = $TBpers->select("CONCAT(pers_prefix,pers_firstname,' ',pers_lastname) AS Repairman")
            ->where('pers_id',$data['RepaiUser'][0]->repair_Repairman)
            ->get()->getResult();

SELECT `tb_repair`.*, `tb_position`.`posi_name`, `tb_personnel`.`pers_prefix`, `tb_personnel`.`pers_firstname`, `tb_personnel`.`pers_lastname`
FROM `tb_repair`
JOIN `skjacth_personnel`.`tb_personnel` ON `tb_repair`.`repair_userID` = `tb_personnel`.`pers_id`
JOIN `skjacth_skj`.`tb_position` ON `tb_repair`.`repair_posi` = `tb_position`.`posi_id`
WHERE `repair_order` = 'SKJRP_20230008'
---
    public function PrintOrder($RepairId){
        $path = (dirname(dirname(dirname(dirname(dirname(__FILE__))))));
		require $path . '/librarie_skj/mpdf/vendor/autoload.php';

        $DBrepair = \Config\Database::connect();
        $TBrepair = $DBrepair->table('tb_repair');
        $DBpers = \Config\Database::connect('personnel');
        $TBpers = $DBpers->table('tb_personnel');
        $data['Datethai'] = new Datethai();

        $data['RepairUser'] = $TBrepair->select('tb_repair.*,tb_position.posi_name,tb_personnel.pers_prefix,tb_personnel.pers_firstname,tb_personnel.pers_lastname')
        ->join('skjacth_personnel.tb_personnel','tb_repair.repair_userID = tb_personnel.pers_id')
        ->join('skjacth_skj.tb_position','tb_repair.repair_posi = tb_position.posi_id')
        ->where('repair_order', urldecode($RepairId))
        ->get()->getResult();