app/Controllers/ConUserBooking.php

    public function BookingMain()
    {
        $session = session();
        $data = $this->DataMain();
        $data['title']="จองห้อง / สถานที่";
        $data['description']="ระบบสำหรับจองห้อง / สถานที่ ภายในโรงเรียน";
        $data['UrlMenuMain'] = 'Booking';
        $data['UrlMenuSub'] = 'BookingMain';

        $database = \Config\Database::connect();
        $builder = $database->table('tb_location');
        $data['CountLocationRoomAll'] = $builder->countAll();

        $DBbooking = $database->table('tb_booking');
        $data['CountbookingAll'] = $DBbooking->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tb_location`
SELECT COUNT(*) AS `numrows` FROM `tb_booking`

    public function BookingSelect()
    {
        $data = $this->DataMain();
        $data['title']="เลือกห้อง / สถานที่";
        $data['description']="เลือกห้องสำหรับใช้ภายในโรงเรียน";
        $data['UrlMenuMain'] = 'Booking';
        $data['UrlMenuSub'] = 'BookingSelect';
        $session = session();


        $database = \Config\Database::connect();
        $builder = $database->table('tb_location');
        $data['LocationRoomAll'] = $builder->get()->getResult();
---
SELECT *
FROM `tb_location`

    public function BookingAdd($LocationID = null)
    {
        $session = session();
        $data = $this->DataMain();
        $data['title']="จองห้อง / สถานที่";
        $data['description']="จองห้องสำหรับใช้ภายในโรงเรียน";
        $data['UrlMenuMain'] = 'Booking';
        $data['UrlMenuSub'] = 'BookingAdd';
        $data['Datethai'] = new Datethai();

        $database = \Config\Database::connect();
        $DBlocation = $database->table('tb_location');
        $tb_booking = $database->table('tb_booking');
        $myTime = Time::now('asia/bangkok', 'th_TH');

        $data['loca'] = $DBlocation->where('location_ID',$LocationID)->get()->getRow();
        $data['BookignToday'] = $tb_booking
        ->select('booking_title,booking_dateStart,booking_timeStart,booking_dateEnd,booking_timeEnd')
        ->where('booking_locationroom',$LocationID)
        ->get()->getResult();
---
SELECT *
FROM `tb_location`
WHERE `location_ID` = '1'
SELECT `booking_title`, `booking_dateStart`, `booking_timeStart`, `booking_dateEnd`, `booking_timeEnd`
FROM `tb_booking`
WHERE `booking_locationroom` = '1'

    public function ShowTimeBooking(){
        $session = session();
        $database = \Config\Database::connect();
        $DBbooking = $database->table('tb_booking');

       $S_data = $DBbooking->select('booking_locationroom,booking_title,booking_dateStart,booking_dateEnd,booking_timeStart,booking_timeEnd,location_name')
       ->join('tb_location','tb_booking.booking_locationroom = tb_location.location_ID')
       ->where('booking_status','อนุมัติ')
       ->get()->getResult();
---
SELECT `booking_locationroom`, `booking_title`, `booking_dateStart`, `booking_dateEnd`, `booking_timeStart`, `booking_timeEnd`, `location_name`
FROM `tb_booking`
JOIN `tb_location` ON `tb_booking`.`booking_locationroom` = `tb_location`.`location_ID`
WHERE `booking_status` = 'อนุมัติ'