app/Models/FoodReportModel.php

    public function getFoodReportsWithRecorderDetails($year = null)
    {
        $builder = $this->select('tb_food_reports.*, CONCAT(p.pers_prefix,p.pers_firstname, " ", p.pers_lastname) as recorder_full_name')
                    ->join('skjacth_personnel.tb_personnel as p', 'p.pers_id = tb_food_reports.food_admin', 'left');

        if ($year) {
            $builder->where('YEAR(tb_food_reports.food_date)', $year);
        }

        return $builder->orderBy('tb_food_reports.food_date', 'DESC')
                    ->orderBy('tb_food_reports.food_id', 'DESC')
                    ->findAll();
---
SELECT `tb_food_reports`.*, CONCAT(p.pers_prefix, `p`.`pers_firstname`, " ", p.pers_lastname) as recorder_full_name
FROM `tb_food_reports`
LEFT JOIN `skjacth_personnel`.`tb_personnel` as `p` ON `p`.`pers_id` = `tb_food_reports`.`food_admin`
WHERE YEAR(tb_food_reports.food_date) = '2025'
ORDER BY `tb_food_reports`.`food_date` DESC, `tb_food_reports`.`food_id` DESC