app/Models/FoodReportModel.php

SELECT `tb_food_reports`.*, CONCAT(p.pers_prefix, `p`.`pers_firstname`, " ", p.pers_lastname) as recorder_full_name
FROM `tb_food_reports`
LEFT JOIN `skjacth_personnel`.`tb_personnel` as `p` ON `p`.`pers_id` = `tb_food_reports`.`food_admin`
ORDER BY `tb_food_reports`.`created_at` DESC
---
    public function getFoodReportsWithRecorderDetails()
    {
        return $this->select('tb_food_reports.*, CONCAT(p.pers_prefix,p.pers_firstname, " ", p.pers_lastname) as recorder_full_name')
                    ->join('skjacth_personnel.tb_personnel as p', 'p.pers_id = tb_food_reports.food_admin', 'left')
                    ->orderBy('tb_food_reports.created_at', 'DESC')
                    ->findAll();